Repository: yeager/swedish-tm
Catalog: sv-weblate.tmx
Source language: en
Languages: sv

source: PostgreSQL containers do not support automatic upgrading between version, you need to perform the upgrade manually. Following steps show one of the options of upgrading.
sv: PostgreSQL-containrar stÃ¶der inte automatisk uppgradering mellan versioner, du mÃ¥ste utfÃ¶ra uppgraderingen manuellt. FÃ¶ljande steg visar ett av alternativen fÃ¶r uppgradering.

source: Stop Weblate container:
sv: Stoppa Weblate-containern:

source: Backup the database:
sv: SÃ¤kerhetskopiera databasen:

source: Stop the database container:
sv: Stoppa databasbehÃ¥llaren:

source: Remove the PostgreSQL volume:
sv: Ta bort PostgreSQL-volymen:

source: The volume name contains name of the Docker Compose project, which is by default the directory name what is ``weblate-docker`` in this documentation.
sv: Volymnamnet innehÃ¥ller namnet pÃ¥ Docker Compose-projektet, som standard Ã¤r det katalognamnet, vilket i denna dokumentation Ã¤r ``weblate-docker``.

source: Adjust :file:`docker-compose.yml` to use new PostgreSQL version.
sv: Justera :file:`docker-compose.yml` fÃ¶r att anvÃ¤nda den nya versionen av PostgreSQL.

source: Start the database container:
sv: Starta databascontainern:

source: Restore the database from the backup:
sv: Ã terstÃ¤ll databasen frÃ¥n sÃ¤kerhetskopian:

source: Please check that the database name matches :envvar:`POSTGRES_DB`.
sv: Kontrollera att databasnamnet stÃ¤mmer Ã¶verens med :envvar:`POSTGRES_DB`.

source: (Optional) Update password for the Weblate user. This might be needed when migrating to PostgreSQL 14 or 15 as way of storing passwords has been changed:
sv: (Valfritt) Uppdatera lÃ¶senordet fÃ¶r Weblate-anvÃ¤ndaren. Detta kan behÃ¶vas vid migrering till PostgreSQL 14 eller 15, eftersom sÃ¤ttet att lagra lÃ¶senord har Ã¤ndrats:

source: Start all remaining containers:
sv: Starta alla Ã¥terstÃ¥ende behÃ¥llare:

source: Admin sign in
sv: AdministratÃ¶rsinloggning

source: After container setup, you can sign in as `admin` user with password provided in :envvar:`WEBLATE_ADMIN_PASSWORD`, or a random password generated on first start if that was not set.
sv: Efter att containern har konfigurerats kan du logga in som administratÃ¶r med lÃ¶senordet som anges i :envvar:`WEBLATE_ADMIN_PASSWORD`, eller ett slumpmÃ¤ssigt lÃ¶senord som genereras vid fÃ¶rsta start om det inte har angetts.

source: To reset `admin` password, restart the container with :envvar:`WEBLATE_ADMIN_PASSWORD` set to new password.
sv: FÃ¶r att Ã¥terstÃ¤lla `admin`-lÃ¶senordet, starta om behÃ¥llaren med :envvar:`WEBLATE_ADMIN_PASSWORD` instÃ¤llt pÃ¥ det nya lÃ¶senordet.

source: Number of processes and memory consumption
sv: Antal processer och minnesfÃ¶rbrukning

source: The number of worker processes for both WSGI and Celery is determined automatically based on number of CPUs. This works well for most cloud virtual machines as these typically have few CPUs and good amount of memory.
sv: Antalet arbetsprocesser fÃ¶r bÃ¥de WSGI och Celery bestÃ¤ms automatiskt utifrÃ¥n antalet processorer. Detta fungerar bra fÃ¶r de flesta virtuella molnmaskiner, eftersom dessa vanligtvis har fÃ¥ processorer och mycket minne.

source: In case you have a lot of CPU cores and hit out of memory issues, try reducing number of workers:
sv: Om du har mÃ¥nga CPU-kÃ¤rnor och stÃ¶ter pÃ¥ minnesproblem kan du prova att minska antalet arbetare:

source: You can also fine-tune individual worker categories:
sv: Du kan ocksÃ¥ finjustera enskilda arbetstagarkategorier:

source: Memory usage can be further reduced by running only a single Celery process:
sv: MinnesanvÃ¤ndningen kan minskas ytterligare genom att endast kÃ¶ra en enda Celery-process:

source: Scaling horizontally
sv: Horisontell skalning

source: You can run multiple Weblate containers to scale the service horizontally. The :file:`/app/data` volume has to be shared by all containers, it is recommended to use cluster filesystem such as GlusterFS for this. The :file:`/app/cache` volume should be separate for each container.
sv: Du kan kÃ¶ra flera Weblate-containrar fÃ¶r att skala tjÃ¤nsten horisontellt. Volymen :file:`/app/data` mÃ¥ste delas av alla containrar, och det rekommenderas att anvÃ¤nda ett klusterfilsystem som GlusterFS fÃ¶r detta. Volymen :file:`/app/cache` bÃ¶r vara separat fÃ¶r varje container.

source: Each Weblate container has defined role using :envvar:`WEBLATE_SERVICE` environment variable. Please follow carefully the documentation as some of the services should be running just once in the cluster, and the order of the services matters as well.
sv: Varje Weblate-container har en definierad roll med hjÃ¤lp av miljÃ¶variabeln :envvar:`WEBLATE_SERVICE`. FÃ¶lj dokumentationen noggrant, eftersom vissa tjÃ¤nster endast ska kÃ¶ras en gÃ¥ng i klustret och ordningen pÃ¥ tjÃ¤nsterna ocksÃ¥ Ã¤r viktig.

source: You can find example setup in the ``docker-compose`` repo as `docker-compose-split.yml <https://github.com/WeblateOrg/docker-compose/blob/main/docker-compose-split.yml>`__.
sv: Du hittar exempel pÃ¥ instÃ¤llningar i ``docker-compose``-repositoriet som `docker-compose-split.yml <https://github.com/WeblateOrg/docker-compose/blob/main/docker-compose-split.yml>`__.

source: Docker environment variables
sv: Docker-miljÃ¶variabler

source: Many of Weblate's :ref:`config` can be set in the Docker container using the environment variables described below.
sv: MÃ¥nga av Weblates :ref:`config` kan stÃ¤llas in i Docker-containern med hjÃ¤lp av de miljÃ¶variabler som beskrivs nedan.

source: If you need to define a setting not exposed through Docker environment variables, see :ref:`docker-custom-config`.
sv: Om du behÃ¶ver definiera en instÃ¤llning som inte exponeras via Docker-miljÃ¶variabler, se :ref:`docker-custom-config`.

source: Passing secrets
sv: Att vidarebefordra hemligheter

source: Weblate container supports passing secrets as files. To utilize that, append ``_FILE`` suffix to the environment variable and pass secret file via Docker.
sv: Weblate-containern stÃ¶der Ã¶verfÃ¶ring av hemlig information som filer. FÃ¶r att utnyttja detta, lÃ¤gg till suffixet ``_FILE`` till miljÃ¶variabeln och Ã¶verfÃ¶r den hemliga filen via Docker.

source: Related :file:`docker-compose.yml` might look like:
sv: Relaterat :file:`docker-compose.yml` kan se ut sÃ¥ hÃ¤r:

source: `How to use secrets in Docker Compose <https://docs.docker.com/compose/how-tos/use-secrets/>`_
sv: `Hur man anvÃ¤nder hemligheter i Docker Compose <https://docs.docker.com/compose/how-tos/use-secrets/>`_

source: Generic settings
sv: Generella instÃ¤llningar

source: Configures Django debug mode using :setting:`DEBUG`.
sv: Konfigurerar Djangos felsÃ¶kningslÃ¤ge med hjÃ¤lp av :setting:`DEBUG`.

source: Configures the logging verbosity. Set this to ``DEBUG`` to get more detailed logs.
sv: Konfigurerar loggningsdetaljnivÃ¥n. StÃ¤ll in detta pÃ¥ ``DEBUG`` fÃ¶r att fÃ¥ mer detaljerade loggar.

source: Defaults to ``INFO`` when :envvar:`WEBLATE_DEBUG` is turned off, ``DEBUG`` is used when debug mode is turned on.
sv: StandardvÃ¤rdet Ã¤r ``INFO`` nÃ¤r :envvar:`WEBLATE_DEBUG` Ã¤r avstÃ¤ngt, ``DEBUG`` anvÃ¤nds nÃ¤r felsÃ¶kningslÃ¤get Ã¤r aktiverat.

source: For more silent logging use ``ERROR`` or ``WARNING``.
sv: FÃ¶r mer tyst loggning, anvÃ¤nd ``ERROR`` eller ``WARNING``.

source: Configures the logging of the database queries verbosity.
sv: Konfigurerar loggningen av databasfrÃ¥gornas detaljeringsgrad.

source: Configures remote logging using GELF TCP connection. Can be used to integrate with Graylog.
sv: Konfigurerar fjÃ¤rrloggning med hjÃ¤lp av GELF TCP-anslutning. Kan anvÃ¤ndas fÃ¶r integration med Graylog.

source: Use custom port for :envvar:`WEBLATE_LOG_GELF_HOST`, defaults to 12201.
sv: AnvÃ¤nd anpassad port fÃ¶r :envvar:`WEBLATE_LOG_GELF_HOST`, standardvÃ¤rdet Ã¤r 12201.

source: Changes the site-title shown in the header of all pages.
sv: Ãndrar webbplatsens titel som visas i rubriken pÃ¥ alla sidor.

source: Configures the site domain. This parameter is required.
sv: Konfigurerar webbplatsdomÃ¤nen. Denna parameter Ã¤r obligatorisk.

source: Include port if using a non-standard one.
sv: Ange port om du anvÃ¤nder en icke-standardport.

source: Configures the site-admin's name and e-mail. It is used for both :setting:`ADMINS` setting and creating `admin` user (see :envvar:`WEBLATE_ADMIN_PASSWORD` for more info on that).
sv: Konfigurerar webbplatsadministratÃ¶rens namn och e-postadress. AnvÃ¤nds bÃ¥de fÃ¶r instÃ¤llningen :setting:`ADMINS` och fÃ¶r att skapa anvÃ¤ndaren `admin` (se :envvar:`WEBLATE_ADMIN_PASSWORD` fÃ¶r mer information om detta).

source: Sets the password for the `admin` user.
sv: StÃ¤ller in lÃ¶senordet fÃ¶r anvÃ¤ndaren `admin`.

source: If not set and `admin` user does not exist, it is created with a random password shown on first container startup.
sv: Om det inte Ã¤r instÃ¤llt och anvÃ¤ndaren `admin` inte finns, skapas den med ett slumpmÃ¤ssigt lÃ¶senord som visas nÃ¤r den fÃ¶rsta behÃ¥llaren startas.

source: If not set and `admin` user exists, no action is performed.
sv: Om det inte Ã¤r instÃ¤llt och anvÃ¤ndaren `admin` finns, utfÃ¶rs ingen Ã¥tgÃ¤rd.

source: If set the `admin` user is adjusted on every container startup to match :envvar:`WEBLATE_ADMIN_PASSWORD`, :envvar:`WEBLATE_ADMIN_NAME` and :envvar:`WEBLATE_ADMIN_EMAIL`.
sv: Om instÃ¤llningen Ã¤r aktiverad justeras anvÃ¤ndaren `admin` vid varje containerstart sÃ¥ att den matchar :envvar:`WEBLATE_ADMIN_PASSWORD`, :envvar:`WEBLATE_ADMIN_NAME` och :envvar:`WEBLATE_ADMIN_EMAIL`.

source: It might be a security risk to store password in the configuration file. Consider using this variable only for initial setup (or let Weblate generate random password on initial startup) or for password recovery.
sv: Det kan vara en sÃ¤kerhetsrisk att lagra lÃ¶senordet i konfigurationsfilen. ÃvervÃ¤g att endast anvÃ¤nda denna variabel fÃ¶r den initiala konfigurationen (eller lÃ¥t Weblate generera ett slumpmÃ¤ssigt lÃ¶senord vid den fÃ¶rsta starten) eller fÃ¶r Ã¥terstÃ¤llning av lÃ¶senord.

source: Whether to sent e-mail to admins upon server error. Turned on by default.
sv: Om e-post ska skickas till administratÃ¶rer vid serverfel. Aktiverat som standard.

source: You might want to use other error collection like Sentry or Rollbar and turn this off.
sv: Du kanske vill anvÃ¤nda andra felinsamlingsverktyg som Sentry eller Rollbar och stÃ¤nga av den hÃ¤r funktionen.

source: The email address that error messages are sent from.
sv: Den e-postadress som felmeddelanden skickas frÃ¥n.

source: Configures the address for outgoing e-mails.
sv: Konfigurerar adressen fÃ¶r utgÃ¥ende e-postmeddelanden.

source: Configures :setting:`ADMINS_CONTACT`.
sv: Konfigurerar :setting:`ADMINS_CONTACT`.

source: Configures contact form behavior, see :setting:`CONTACT_FORM`.
sv: Konfigurerar kontaktformulÃ¤rets beteende, se :setting:`CONTACT_FORM`.

source: Configures allowed HTTP hostnames using :setting:`ALLOWED_HOSTS`.
sv: Konfigurerar tillÃ¥tna HTTP-vÃ¤rdnamn med hjÃ¤lp av :setting:`ALLOWED_HOSTS`.

source: Defaults to ``*`` which allows all hostnames.
sv: StandardinstÃ¤llningen Ã¤r ``*``, vilket tillÃ¥ter alla vÃ¤rdnamn.

source: Configures whether registrations are open by toggling :std:setting:`REGISTRATION_OPEN`.
sv: Konfigurerar om registreringar Ã¤r Ã¶ppna genom att vÃ¤xla :std:setting:`REGISTRATION_OPEN`.

source: Configures whether captcha is used for registration and other unauthenticated actions, see :std:setting:`REGISTRATION_CAPTCHA`.
sv: Konfigurerar om captcha anvÃ¤nds fÃ¶r registrering och andra oautentiserade Ã¥tgÃ¤rder, se :std:setting:`REGISTRATION_CAPTCHA`.

source: Configure which authentication methods can be used to create new account via :setting:`REGISTRATION_ALLOW_BACKENDS`.
sv: Konfigurera vilka autentiseringsmetoder som kan anvÃ¤ndas fÃ¶r att skapa nya konton via :setting:`REGISTRATION_ALLOW_BACKENDS`.

source: Configures :std:setting:`REGISTRATION_REBIND`.
sv: Konfigurerar :std:setting:`REGISTRATION_REBIND`.

source: Configures the used time zone in Weblate, see :std:setting:`django:TIME_ZONE`.
sv: Konfigurerar den tidszon som anvÃ¤nds i Weblate, se :std:setting:`django:TIME_ZONE`.

source: To change the time zone of the Docker container itself, use the ``TZ`` environment variable.
sv: FÃ¶r att Ã¤ndra tidszonen fÃ¶r sjÃ¤lva Docker-containern anvÃ¤nder du miljÃ¶variabeln ``TZ``.

source: Makes Weblate assume it is operated behind a reverse HTTPS proxy, it makes Weblate use HTTPS in e-mail and API links or set secure flags on cookies.
sv: FÃ¥r Weblate att anta att det drivs bakom en omvÃ¤nd HTTPS-proxy, vilket gÃ¶r att Weblate anvÃ¤nder HTTPS i e-post och API-lÃ¤nkar eller sÃ¤tter sÃ¤kra flaggor pÃ¥ cookies.

source: Please see :setting:`ENABLE_HTTPS` documentation for possible caveats.
sv: Se dokumentationen fÃ¶r :setting:`ENABLE_HTTPS` fÃ¶r eventuella varningar.

source: This does not make the Weblate container accept HTTPS connections, you need to configure that as well, see :ref:`docker-ssl` for examples.
sv: Detta gÃ¶r inte att Weblate-containern accepterar HTTPS-anslutningar, du mÃ¥ste ocksÃ¥ konfigurera det, se :ref:`docker-ssl` fÃ¶r exempel.

source: Lets Weblate fetch the IP address from any given HTTP header. Use this when using a reverse proxy in front of the Weblate container.
sv: LÃ¥t Weblate hÃ¤mta IP-adressen frÃ¥n valfri HTTP-header. AnvÃ¤nd detta nÃ¤r du anvÃ¤nder en omvÃ¤nd proxy framfÃ¶r Weblate-containern.

source: Enables :setting:`IP_BEHIND_REVERSE_PROXY` and sets :setting:`IP_PROXY_HEADER`.
sv: Aktiverar :setting:`IP_BEHIND_REVERSE_PROXY` och stÃ¤ller in :setting:`IP_PROXY_HEADER`.

source: The format must conform to Django's expectations. Django `transforms <https://docs.djangoproject.com/en/2.2/ref/request-response/#django.http.HttpRequest.META>`_ raw HTTP header names as follows:
sv: Formatet mÃ¥ste Ã¶verensstÃ¤mma med Djangos fÃ¶rvÃ¤ntningar. Django `transformerar <https://docs.djangoproject.com/en/2.2/ref/request-response/#django.http.HttpRequest.META>`_ rÃ¥a HTTP-rubriknamn enligt fÃ¶ljande:

source: converts all characters to uppercase
sv: konverterar alla tecken till versaler

source: replaces any hyphens with underscores
sv: ersÃ¤tter alla bindestreck med understreck

source: prepends ``HTTP_`` prefix
sv: lÃ¤gger till prefixet ``HTTP_`` fÃ¶re

source: So ``X-Forwarded-For`` would be mapped to ``HTTP_X_FORWARDED_FOR``.
sv: SÃ¥ledes skulle ``X-Forwarded-For`` mappas till ``HTTP_X_FORWARDED_FOR``.

source: Configures :setting:`IP_PROXY_OFFSET`.
sv: Konfigurerar :setting:`IP_PROXY_OFFSET`.

source: A boolean that specifies whether to use the :http:header:`X-Forwarded-Port` header in preference to the SERVER_PORT META variable. This should only be enabled if a proxy which sets this header is in use.
sv: En boolesk variabel som anger om :http:header:`X-Forwarded-Port`-rubriken ska anvÃ¤ndas i stÃ¤llet fÃ¶r SERVER_PORT META-variabeln. Detta bÃ¶r endast aktiveras om en proxy som stÃ¤ller in denna rubrik anvÃ¤nds.

source: This is a boolean setting (use ``"true"`` or ``"false"``).
sv: Detta Ã¤r en boolesk instÃ¤llning (anvÃ¤nd ``"true"`` eller ``"false"``).

source: A tuple representing a HTTP header/value combination that signifies a request is secure. This is needed when Weblate is running behind a reverse proxy doing SSL termination which does not pass standard HTTPS headers.
sv: En tupel som representerar en kombination av HTTP-rubrik och vÃ¤rde som anger att en begÃ¤ran Ã¤r sÃ¤ker. Detta behÃ¶vs nÃ¤r Weblate kÃ¶rs bakom en omvÃ¤nd proxy som utfÃ¶r SSL-terminering och som inte vidarebefordrar standard-HTTPS-rubriker.

source: Enables :setting:`REQUIRE_LOGIN` to enforce authentication on whole Weblate.
sv: Aktiverar :setting:`REQUIRE_LOGIN` fÃ¶r att krÃ¤va autentisering pÃ¥ hela Weblate.

source: Configures ID for Google Analytics by changing :setting:`GOOGLE_ANALYTICS_ID`.
sv: Konfigurerar ID fÃ¶r Google Analytics genom att Ã¤ndra :setting:`GOOGLE_ANALYTICS_ID`.

source: Configures the default title and message for pull requests via API by changing :setting:`DEFAULT_PULL_MESSAGE`.
sv: Konfigurerar standardrubrik och meddelande fÃ¶r pull-fÃ¶rfrÃ¥gningar via API genom att Ã¤ndra :setting:`DEFAULT_PULL_MESSAGE`.

source: Configures the language simplification policy, see :setting:`SIMPLIFY_LANGUAGES`.
sv: Konfigurerar policyn fÃ¶r sprÃ¥klig fÃ¶renkling, se :setting:`SIMPLIFY_LANGUAGES`.

source: Configures the default :ref:`project-access_control` for new projects, see :setting:`DEFAULT_ACCESS_CONTROL`.
sv: Konfigurerar standardinstÃ¤llningen :ref:`project-access_control` fÃ¶r nya projekt, se :setting:`DEFAULT_ACCESS_CONTROL`.

source: Configures the default value for :ref:`component-restricted` for new components, see :setting:`DEFAULT_RESTRICTED_COMPONENT`.
sv: Konfigurerar standardvÃ¤rdet fÃ¶r :ref:`component-restricted` fÃ¶r nya komponenter, se :setting:`DEFAULT_RESTRICTED_COMPONENT`.

source: Configures the default value for :ref:`component-allow_translation_propagation` for new components, see :setting:`DEFAULT_TRANSLATION_PROPAGATION`.
sv: Konfigurerar standardvÃ¤rdet fÃ¶r :ref:`component-allow_translation_propagation` fÃ¶r nya komponenter, se :setting:`DEFAULT_TRANSLATION_PROPAGATION`.

source: Configures :setting:`DEFAULT_COMMITER_EMAIL`.
sv: Konfigurerar :setting:`DEFAULT_COMMITER_EMAIL`.

source: Configures :setting:`DEFAULT_COMMITER_NAME`.
sv: Konfigurerar :setting:`DEFAULT_COMMITER_NAME`.

source: Configures :setting:`DEFAULT_SHARED_TM`.
sv: Konfigurerar :setting:`DEFAULT_SHARED_TM`.

source: Configures :setting:`DEFAULT_AUTOCLEAN_TM`.
sv: Konfigurerar :setting:`DEFAULT_AUTOCLEAN_TM`.

source: Configures GPG signing of commits, see :setting:`WEBLATE_GPG_IDENTITY`.
sv: Konfigurerar GPG-signering av commit, se :setting:`WEBLATE_GPG_IDENTITY`.

source: Configures URL prefix where Weblate is running, see :setting:`URL_PREFIX`.
sv: Konfigurerar URL-prefix dÃ¤r Weblate kÃ¶rs, se :setting:`URL_PREFIX`.

source: Configures URL prefix for static files server from :setting:`CACHE_DIR`.
sv: Konfigurerar URL-prefix fÃ¶r server fÃ¶r statiska filer frÃ¥n :setting:`CACHE_DIR`.

source: Configures checks which you do not want to be displayed, see :setting:`django:SILENCED_SYSTEM_CHECKS`.
sv: Konfigurerar kontroller som du inte vill ska visas, se :setting:`django:SILENCED_SYSTEM_CHECKS`.

source: Allows to customize :http:header:`Content-Security-Policy` HTTP header.
sv: GÃ¶r det mÃ¶jligt att anpassa HTTP-rubriken :http:header:`Content-Security-Policy`.

source: Configures :setting:`LICENSE_FILTER`.
sv: Konfigurerar :setting:`LICENSE_FILTER`.

source: Configures :setting:`LICENSE_REQUIRED`.
sv: Konfigurerar :setting:`LICENSE_REQUIRED`.

source: Configures :setting:`WEBSITE_REQUIRED`.
sv: Konfigurerar :setting:`WEBSITE_REQUIRED`.

source: Configures :setting:`HIDE_VERSION`.
sv: Konfigurerar :setting:`HIDE_VERSION`.

source: Configures :setting:`BASIC_LANGUAGES`.
sv: Konfigurerar :setting:`BASIC_LANGUAGES`.

source: Configures :setting:`DEFAULT_AUTO_WATCH`.
sv: Konfigurerar :setting:`DEFAULT_AUTO_WATCH`.

source: Configures rate limiter.
sv: Konfigurerar hastighetsbegrÃ¤nsaren.

source: You can set configuration for any rate limiter scopes. To do that add ``WEBLATE_`` prefix to any of setting described in :ref:`rate-limit`.
sv: Du kan stÃ¤lla in konfigurationen fÃ¶r alla hastighetsbegrÃ¤nsare. FÃ¶r att gÃ¶ra det lÃ¤gger du till prefixet ``WEBLATE_`` till nÃ¥gon av instÃ¤llningarna som beskrivs i :ref:`rate-limit`.

source: Configures API rate limiting. Defaults to ``100/day`` for anonymous and ``5000/hour`` for authenticated users.
sv: Konfigurerar API-hastighetsbegrÃ¤nsning. StandardvÃ¤rdet Ã¤r ``100/dag`` fÃ¶r anonyma anvÃ¤ndare och ``5000/timme`` fÃ¶r autentiserade anvÃ¤ndare.

source: Configures :setting:`ENABLE_HOOKS`.
sv: Konfigurerar :setting:`ENABLE_HOOKS`.

source: Configures :setting:`ENABLE_AVATARS`.
sv: Konfigurerar :setting:`ENABLE_AVATARS`.

source: Configures :setting:`AVATAR_URL_PREFIX`.
sv: Konfigurerar :setting:`AVATAR_URL_PREFIX`.

source: Configures :setting:`LIMIT_TRANSLATION_LENGTH_BY_SOURCE_LENGTH`.
sv: Konfigurerar :setting:`LIMIT_TRANSLATION_LENGTH_BY_SOURCE_LENGTH`.

source: Configures :setting:`SSH_EXTRA_ARGS`.
sv: Konfigurerar :setting:`SSH_EXTRA_ARGS`.

source: Configures :setting:`BORG_EXTRA_ARGS` as a comma separated list of args.
sv: Konfigurerar :setting:`BORG_EXTRA_ARGS` som en kommaseparerad lista med argument.

source: Configures :setting:`ENABLE_SHARING`.
sv: Konfigurerar :setting:`ENABLE_SHARING`.

source: Configures :setting:`SUPPORT_STATUS_CHECK`.
sv: Konfigurerar :setting:`SUPPORT_STATUS_CHECK`.

source: Configures :setting:`EXTRA_HTML_HEAD`.
sv: Konfigurerar :setting:`EXTRA_HTML_HEAD`.

source: Configures :setting:`PRIVATE_COMMIT_EMAIL_TEMPLATE`.
sv: Konfigurerar :setting:`PRIVATE_COMMIT_EMAIL_TEMPLATE`.

source: Configures :setting:`PRIVATE_COMMIT_EMAIL_OPT_IN`.
sv: Konfigurerar :setting:`PRIVATE_COMMIT_EMAIL_OPT_IN`.

source: Configures :setting:`UNUSED_ALERT_DAYS`.
sv: Konfigurerar :setting:`UNUSED_ALERT_DAYS`.

source: Configures :setting:`UPDATE_LANGUAGES`.
sv: Konfigurerar :setting:`UPDATE_LANGUAGES`.

source: Configures :setting:`VCS_ALLOW_HOSTS`.
sv: Konfigurerar :setting:`VCS_ALLOW_HOSTS`.

source: Configures :setting:`VCS_ALLOW_SCHEMES`.
sv: Konfigurerar :setting:`VCS_ALLOW_SCHEMES`.

source: Configures :setting:`VCS_CLONE_DEPTH`.
sv: Konfigurerar :setting:`VCS_CLONE_DEPTH`.

source: Configures :setting:`VCS_API_DELAY`.
sv: Konfigurerar :setting:`VCS_API_DELAY`.

source: Configures :setting:`VCS_API_TIMEOUT`.
sv: Konfigurerar :setting:`VCS_API_TIMEOUT`.

source: Allow CORS requests to API from given origins.
sv: TillÃ¥t CORS-fÃ¶rfrÃ¥gningar till API frÃ¥n angivna ursprung.

source: Allows CORS requests to API from all origins.
sv: TillÃ¥ter CORS-fÃ¶rfrÃ¥gningar till API frÃ¥n alla ursprung.

source: Configures maximal body size accepted by the built-in web server.
sv: Konfigurerar maximal kroppsstorlek som accepteras av den inbyggda webbservern.

source: This variable intentionally lacks ``WEBLATE_`` prefix as it is shared with third-party container used in :ref:`docker-https-portal`.
sv: Denna variabel saknar avsiktligt prefixet ``WEBLATE_`` eftersom den delas med en tredjepartscontainer som anvÃ¤nds i :ref:`docker-https-portal`.

source: Code hosting sites credentials
sv: Inloggningsuppgifter fÃ¶r kodhostingsajter

source: In the Docker container, the code hosting credentials can be configured either in separate variables or using a Python dictionary to set them at once. The following examples are for :ref:`vcs-github`, but applies to all :ref:`vcs` with appropriately changed variable names.
sv: I Docker-containern kan kodens autentiseringsuppgifter konfigureras antingen i separata variabler eller med hjÃ¤lp av en Python-ordlista fÃ¶r att stÃ¤lla in dem pÃ¥ en gÃ¥ng. FÃ¶ljande exempel gÃ¤ller fÃ¶r :ref:`vcs-github`, men gÃ¤ller alla :ref:`vcs` med lÃ¤mpligt Ã¤ndrade variabelnamn.

source: All environment variable names must include the ``WEBLATE_`` prefix. For example, to configure GitHub credentials, use ``WEBLATE_GITHUB_USERNAME``, not ``GITHUB_USERNAME``. This applies whether you're configuring for pull requests or any other VCS integration.
sv: Alla miljÃ¶variabelnamn mÃ¥ste innehÃ¥lla prefixet ``WEBLATE_``. Om du till exempel vill konfigurera GitHub-inloggningsuppgifter anvÃ¤nder du ``WEBLATE_GITHUB_USERNAME``, inte ``GITHUB_USERNAME``. Detta gÃ¤ller oavsett om du konfigurerar fÃ¶r pull-fÃ¶rfrÃ¥gningar eller nÃ¥gon annan VCS-integration.

source: An example configuration for GitHub pull requests might look like:
sv: En exempelkonfiguration fÃ¶r GitHub-pull-fÃ¶rfrÃ¥gningar kan se ut sÃ¥ hÃ¤r:

source: Will be used as:
sv: Kommer att anvÃ¤ndas som:

source: Alternatively the Python dictionary can be provided as a string:
sv: Alternativt kan Python-ordlistan anges som en strÃ¤ng:
